public class Hercules {
	private static int answer_given, answer;
	private static int checkpoint = 1;
	private static boolean k = true, father_zeus = true;
	private static Graphics panel = new Graphics();

/*****************************************************
 * Beginning of story of Hercules. Checking the checkpoint
 * and running the corresponding story part.
 *****************************************************/
	public Hercules() {
		panel.setMessage("\nΤο ακόλουθο παιχνίδι θα βασιστεί πάνω σε ερωτήσεις σχετικά με τη ζωή του ήρωα και τους άθλους που διέπραξε.");
		panel.setMessage("\nΟ Ηρακλής ήταν αρχαίος μυθικός ήρωας, θεωρούμενος ως ο μέγιστος των Ελλήνων ηρώων."
				+ "\n\nΩς Άθλοι του Ηρακλέους έχουν καταγραφεί στην ελληνική μυθολογία δώδεκα κατορθώματα που έκανε ο μυθικός αυτός ήρωας,"
				+ "\nπροκειμένου να εξαγνισθεί για το φόνο της γυναίκας του και των παιδιών του, που είχε διαπράξει όταν τον τρέλανε η Ήρα."
				+ "\nΓια το σκοπό αυτό, ο Ηρακλής πήγε στο Μαντείο των Δελφών και πήρε χρησμό, σύμφωνα με τον οποίο έπρεπε να υπηρετήσει"
				+ "\nγια δώδεκα χρόνια τον Ευρυσθέα, βασιλιά της Τίρυνθας, και να πραγματοποιήσει τους άθλους που του πρόσταζε εκείνος.");
				
		while (checkpoint != 10) {
			if (checkpoint == 1) {
				assert checkpoint == 1 : "Wrong checkpoint";
				answer_given = fatherOfHercules();
			} else if (checkpoint == 2) {
				assert checkpoint == 2 : "Wrong checkpoint";
				jealousyOfHera(answer_given);
			} else if (checkpoint == 3) {
				assert checkpoint == 3 : "Wrong checkpoint";
				roadChoosing();
			} else if (checkpoint == 4) {
				assert checkpoint == 4 : "Wrong checkpoint";
				howHeDealt();
			} else if (checkpoint == 5) {
				assert checkpoint == 5 : "Wrong checkpoint";
				killingHydra();
			} else if (checkpoint == 6) {
				assert checkpoint == 6 : "Wrong checkpoint";
				assert k == true : "Wrong boolean";
				k=true;
				pathDigging();
			} else if (checkpoint == 7) {
				assert checkpoint == 7 : "Wrong checkpoint";
				minotaurFeat();
			} else if (checkpoint == 8) {
				assert checkpoint == 8 : "Wrong checkpoint";
				theBelt();
			} else if (checkpoint == 9) {
				assert checkpoint == 9 : "Wrong checkpoint";
				dwarfBrothers();
			} else if (checkpoint == 10) {
				assert checkpoint == 10 : "Wrong checkpoint";
				wifeBetrayal();
			}
		}
		endingTitles();
	}

	/*****************************************************
	 * The first story part about Hercules father.
	 * Returns the player's answer.
	 *****************************************************/

	private static int fatherOfHercules() {
		assert checkpoint == 1 : "Wrong checkpoint";
		
		/*****************************************************
		 * checkpoint is getting increased as the first method
		 * is ran.
		 *****************************************************/
		
		checkpoint++;
		panel.setMessage("\nΠοιός ήταν ο πατέρας του Ηρακλή;" 
						+ "\n 1)Δίας." 
						+ "\n 2)Αμφιτρύωνας.");
		answer = Quiz.takeAnAnswer(2);
		assert answer == 1 || answer == 2 : "No such answer";
		return answer;
	}
	
	/*****************************************************
	 * The second story part about the jealousy of Hera.
	 * Checks the previous given answer and continuous
	 * the story accordingly.
	 *****************************************************/
	
	private static void jealousyOfHera(int answer_given) {
		assert checkpoint == 2 : "Wrong checkpoint";		
		checkpoint++;
		assert (answer_given == 1 || answer_given == 2) : "wrong answer_given";
		if (answer_given == 1) {
			
			/*****************************************************
			 * "k" is a boolean where it checks if the "print"
			 * has already been printed before.
			 *****************************************************/
			
			if (k) {
				panel.setMessage("\nΣύμφωνα με τη μυθολογία αυτή είναι η σωστή απάντηση παρότι η Αλκμήνη,"
								+ "\nμητέρα του Ηρακλή, ήταν παντρεμένη με τον Αμφιτρύωνα,"
								+ "\nο Δίας πήρε τη μορφή του Αμφιτρύωνα και κοιμήθηκε με την Αλκμήνη.");
				k = false;
			}
			
			panel.setMessage("\nΗ Ήρα, η γυναίκα του Δία, τον ζήλευε όταν γεννήθηκε ο Ηρακλής και αν ναι πως αντέδρασε;"
							+ "\n 1)Ναι." 
							+ "\n 2)Όχι.");
			answer = Quiz.takeAnAnswer(2);

			if (answer == 1) {
				panel.setMessage("\n 1)Η Ήρα έστειλε φίδια για να σκοτώσουν τον Ηρακλή."
								+ "\n 2)Η Ήρα πήγε η ίδια να σκοτώσει τον Ηρακλή.");
				answer = Quiz.takeAnAnswer(2);

				if (answer == 1) {
					panel.setMessage("\nΗ Ήρα η οποία ζήλευε θανάσιμα τον Δία για τις απιστίες του προκειμένου να τον εκδικηθεί"
									+ "\nέστειλε στην κούνια του βρέφους Ηρακλή δύο φίδια, αλλά αυτός κατάφερε να τα στραγγαλίσει.");

				} else if (answer == 2) {
					panel.setMessage("\n 1)Η Ήρα απέτυχε και δεν σταμάτησε να αναζητεί τρόπο εκδίκησης."
									+ "\n 2)Η Ήρα πέτυχε τον στόχο της και ο Ηρακλής πέθανε.");
					answer = Quiz.takeAnAnswer(2);
					
					if (answer == 1) {
						panel.setMessage("\nΗ Ήρα μετά από κάποια χρόνια κατάφερε να βρει τρόπο να σκοτώσει τον Ηρακλή,"
										+ "\nπαίρνοντας την μορφή ενός φίλου και πνίγοντάς τον στον ύπνο του");

					} else if (answer == 2) {
						panel.setMessage("\nΟ Ηρακλής πέθανε πολύ νωρίς στην Ιστορία.");
						reset();
					}
				}
			} 
			
			else if (answer == 2) {
				panel.setMessage("\nΔεν ζήλευε, οπότε ο Ηρακλής δεν έμαθε ποτέ τις πραγματικές του δυνάμεις.");
				ordinaryPerson();
				answer = 1;
			}

		} else if (answer_given == 2) {
			checkpoint--;
			father_zeus = false;
			panel.setMessage("\nΟ θετός πατέρας του Ηρακλή, ο Αμφιτρύωνας, ανέλαβε να τον μεγαλώσει. Είχαν μια άριστη σχέση πατέρα και γιού,"
							+ "\nπερνόντας αρκετό χρόνο μαζί και κάνοντας διάφορα πράγματα."
							+ "\nΠήγαιναν για ψάρεμα και για κυνήγι και για τον Ηρακλή..."
							+ "\nο Αμφιτρύωνας ήταν κάτι σαν το πρότυπό του.");
			ordinaryPerson(); // Η Ιστορία με πατέρα τον Αμφιτρύωνα.
		}
		
	}
	
	/*****************************************************
	 * The third story part about Hercules having to choose
	 * which road he is going to take.
	 * It changes the overall story depending on the path
	 * he takes.
	 *****************************************************/

	private static void roadChoosing() {
		assert checkpoint == 3 : "Wrong checkpoint";
		checkpoint++;
		panel.setMessage("\nΟ μύθος που σώθηκε από τον Ξενοφώντα, μας διηγείται το περιστατικό εκείνο, όταν ο Ηρακλής καθισμένος σε κάποιο σταυροδρόμι,"
						+ "\nείδε να περνούν από μπροστά του δύο πανέμορφες κοπέλες. Η μια του έδειξε έναν εύκολο δρόμο, φαρδύ και ίσιο, που αν τον ακολουθούσε,"
						+ "\nθα χαιρόταν τη ζωή, αλλά θα έκανε ένα σωρό κακές πράξεις που θα τον καταδίκαζαν στην κρίση των ανθρώπων. Αυτή ήταν η Κακία."
						+ "\nΗ άλλη κόρη, η Αρετή, του έδειξε ένα δύσκολο δρόμο, γεμάτο κοφτερές πέτρες και αγκάθια, στενό και δύσβατο, που θα τον βάδιζε δύσκολα,"
						+ "\nαλλά θα κέρδιζε στο τέλος του την αναγνώριση από τους συνανθρώπους του.");
		
		panel.setMessage("\nΠοιόν δρόμο τελικά επέλεξε ο Ηρακλής;" 
						+ "\n 1)Της Αρετής." 
						+ "\n 2)Της Κακίας.");
		answer = Quiz.takeAnAnswer(2);
		
		if (answer == 1) {
			panel.setMessage("\nΟ Ηρακλής ακολούθησε την Αρετή, προτιμώντας να υποφέρει για να διαβεί το δύσβατο δρόμο της, αλλά να γνωρίσει τη δόξα και την τιμή"
							+ "\nμε τις καλές του πράξεις και την αρετή του. Με την επιλογή του αυτήν η Ήρα συνέχισε να ζηλεύει και παρέσυρε τον Ηρακλή στο να"
							+ "\nσκοτώσει τη γυναίκα του και τα παιδιά του.");

		} else if (answer == 2) {
			panel.setMessage("\nΟ Ηρακλής μεγάλωσε με πολλές γυναίκες και πολλά παιδιά σε ένα ανέμελο δρόμο με πολλές χαρές."
							+ "\nΠαρόλα αυτά η Ήρα συνέχισε να ζηλεύει και τρέλανε τον Ηρακλή οδηγώντας τον να σκοτώσει τη γυναίκα του και τα τρία παιδιά του.");
			
			panel.setMessage("\nΠως συνέχισε ο Ηρακλής την ζωή του;"
					+ "\n 1)Άρχισε να αναπολεί το παρελθόν του και μετάνιωσε για ότι έκανε με παρακίνηση της Ήρας."
					+ "\n 2)Συνέχισε με την ανέμελη ζωή του.");
			answer = Quiz.takeAnAnswer(2);

			if (answer == 1) {
				panel.setMessage("\nΠροσπάθησε να βρει έναν τρόπο για να διορθώσει ότι είχε κάνει.");

			} else if (answer == 2) {
				panel.setMessage("\nΣτα πλαίσια μιας φυσιολογικής και ανέμελης ζωής, έφτασε σε μεγάλη ηλικία πεθαίνοντας από φυσικά αίτια.");
				reset();

			} 

		}
		
		
	}
	
	/*****************************************************
	 * The fourth story part about Hercules realizing his
	 * actions (killing his family).
	 *****************************************************/

	private static void howHeDealt() {
		assert checkpoint == 4 : "Wrong checkpoint";
		checkpoint++;
		panel.setMessage("\nΠως έπραξε ο Ηρακλής όταν συνειδητοποίησε τι έκανε;"
						+ "\n 1)Πήγε στο μαντείο των Δελφών για να μάθει πως μπορούσε να επανορθώσει."
						+ "\n 2)Αυτοκτόνησε από την θλίψη του.");
		answer = Quiz.takeAnAnswer(2);

		if (answer == 1) {
			panel.setMessage("\nΌταν συνειδητοποίησε τι έκανε, αποφάσισε να πάει στο Μαντείο των Δελφών για να πάρει χρησμό, ώστε να μάθει με ποιον τρόπο"
							+ "\nθα μπορούσε να εξαγνισθεί. Σύμφωνα με τον χρησμό, έπρεπε να υπηρετήσει για δώδεκα χρόνια τον Ευρυσθέα, βασιλιά των Μυκηνών,"
							+ "\nκαι να πραγματοποιήσει τους άθλους που θα του πρόσταζε εκείνος.");
		
		} else if (answer == 2) {
			panel.setMessage("\nΟι τύψεις που τον έπνιγαν τον οδήγησα να αυτοκτονήσει και έτσι πέθανε νωρίς στην ιστορία.");
			reset();

		}

	}
	
	/*****************************************************
	 * The fifth story part where the story as we know it
	 * really begins.
	 *****************************************************/

	private static void killingHydra() {
		assert checkpoint == 5 : "Wrong checkpoint";
		checkpoint++;
		// panel.setMessage("Αφήγηση σχετικά με την Λερναία Ύδρα.");
		panel.setMessage("\nΤο δεύτερο κατόρθωμά του Ηρακλή είχε να κάνει με την Λερναία Ύδρα, ενός φιδιού με εννέα κεφάλια που ζούσε στη λίμνη Λέρνη και"
						+ "\nσκορπούσε τη συμφορά στους κατοίκους της περιοχής. Στη θέση κάθε κεφαλιού που έκοβες όμως ξεπετιόνταν άλλα δύο, "
						+ "\nκαι έτσι η εξόντωση της ήταν αρκετά δύσκολη.");

		panel.setMessage("\nΜε ποιόν τρόπο προσπάθησε,λοιπόν, να νικήσει την Λερναία Ύδρα;"
				+ "\n 1)Καθώς έκοβε το κεφάλι, έκαβε ταυτόχρονα και τις πληγές"
				+ "\n 2)Προσπάθησε να καρφώσει την καρδία της Λερναίας Ύδρας."
				+ "\n 3)Δεν προσπάθησε και απλώς έτρεξε να ξεφύγει");
		answer = Quiz.takeAnAnswer(3);

		if (answer == 1) {
			panel.setMessage("\nΑφού στη θέση κάθε κεφαλιού που έκοβε ο Ηρακλής ξεπετιόνταν άλλα δύο,"
							+ "\nαναγκάστηκε όταν έκοβε ένα κεφάλι να καίει με φωτιά το κόψιμο."
							+ "\nΉταν ο μοναδικός τρόπος να καταφέρει να την νικήσει"
							+ "\nΎστερα, αφού σκότωσε το θηρίο, βούτηξε στο αίμα του τα βέλη του και τα κατέστησε θανατηφόρα.");

		} else if (answer == 2) {
			panel.setMessage("\nΤα κατάφερε, αλλά η Λερναία Ύδρα δεν πέθανε και έτσι ο Ηρακλής σκοτώθηκε.");
			reset();

		} else if (answer == 3) {
			panel.setMessage("\nΤι έκανε μετά;" 
							+ "\n 1)Σταμάτησε να τρέχει και ξανά σκέφτηκε τον τρόπο αντιμετώπισης."
							+ "\n 2)Συνέχισε να τρέχει μέχρι που γύρισε τον Ευρυσθέα.");
			answer = Quiz.takeAnAnswer(2);

			if (answer == 1) {
				panel.setMessage("\nΟ Ηρακλής προσπαθεί ξανά να βρει κάποιον τρόπο να εξοντώσει την Λερναία Ύδρα.");
			
			} else if (answer == 2) {
				panel.setMessage("\nΟ Ευρυσθέας του υπενθύμισε γιατί κάνει τους άθλους του και πως έπρεπε να τα καταφέρει.");
				panel.setMessage("\nΠως έπραξε ο Ηρακλής μετά από αυτήν την υπενθύμιση;"
								+ "\n 1)Γύρισε πίσω στην Λερναία Ύδρα για να την αντιμετωπίσει."
								+ "\n 2)Αυτοκτόνησε από την θλίψη του.");
				answer = Quiz.takeAnAnswer(2);

				if (answer == 1) {
					panel.setMessage("\nΗ ιστορία με την Λερναία Ύδρα αρχίζει και πάλι");

				} else if (answer == 2) {
					panel.setMessage("\nΑυτοκτόνησε από την θλίψη και το άγχος του που δεν μπόρεσε να φέρει εις πέρας τους άθλους του.");
					reset();

				}
			}
		}

	}
	
	/*****************************************************
	 * The sixth story part about Hercules having to decide
	 * where he will dig the path that the water will pass
	 * through.
	 *****************************************************/

	private static void pathDigging() {
		assert checkpoint == 6 : "Wrong checkpoint";
		checkpoint++;
		panel.setMessage("\nΈνας άλλος άθλος του Ηρακλή ήταν να καθαρίσει τους στάβλους του Αυγεία,"
				+ "\nτου πλούσιου βασιλιά με τα 3.000 βόδια, που από την κοπριά που είχε μαζευτεί εκεί από τριάντα χρόνια,"
				+ "\nπου είχαν να καθαριστούν οι στάβλοι, είχε πρόβλημα όλο το χωριό. ");
		
		panel.setMessage("\nΟ Ηρακλής πού έσκαψε για να κατευθύνει τα νερά του Πηνειού και του Αλφειού,"
						+ "\nώστε να καθαρίσουν οι στάβλοι του Αυγεία;"
						+ "\n 1)Στα θεμέλια των στάβλων." 
						+ "\n 2)Μέσα στους ίδιους τους στάβλους.");
		answer = Quiz.takeAnAnswer(2);

		if (answer == 1) {
			panel.setMessage("\nΟ Ηρακλής με αυτόν τον τρόπο κατάφερε να κάνει τα νερά να παρασύρουν"
							+ "\nτην κοπρία από τους στάβλους και να καθαριστεί το μέρος.");

		} else if (answer == 2) {
			panel.setMessage("\nΤι αποτελέσματα είχε αυτό στους στάβλους και στην περιοχή;"
							+ "\n 1)Καταστράφηκαν οι στάβλοι εντελώς." 
							+ "\n 2)Δεν επηρρεάστηκαν καθόλου.");
			answer = Quiz.takeAnAnswer(2);

			if (answer == 1) {
				panel.setMessage("\nΈσπασαν οι φράχτες,τα ζώα το έσκασαν και κατέστερψαν την πόλη, με αποτέλεσμα"
						+ "\nοι κάτοικοι να ζητήσουν την ευθανασία του Ηρακλή ως εκδίκηση για τις περιουσίες τους που καταστράφηκαν.");
				reset();

			} else if (answer == 2) {
				panel.setMessage("\nΔεν είχε κανένα αποτέλεσμα στους στάβλους και στην γύρω περιοχή. "
								+ "\nΟ Ηρακλής συνέχισε κανονικά τη ζωή του ως ένας συνηθισμένος άνθρωπος,"
								+ "\nκαθώς δεν είχε την ψυχική δύναμη να συνεχίσει.");
				ordinaryPerson();
			}	
		}
		
		
	}
	
	/*****************************************************
	 * The seventh story part where Hercules had to capture
	 * the minotaur.
	 *****************************************************/

	private static void minotaurFeat() {
		assert checkpoint == 7 : "Wrong checkpoint";
		checkpoint++;
		if (k) {
			panel.setMessage("\nΌσον αφορά τον έβδομο άθλο του Ηρακλή, αυτός ήταν να καταφέρει να αιχμαλωτήσει τον ταύρο της Κρήτης"
					+ "\nή αλλιώς μινώταυρο και να τον πάει ζωντανό στον Ευρυσθέα");
		}
		panel.setMessage("\nΜε ποιον τρόπο κατάφερε λοιπόν ο Ηρακλής να ολοκληρώσει τον έβδομο άθλο;"
						+ "\n 1)Χρησιμοποίησε δίχτυ για να τον ακινητοποιήσει και μετά τον κουβάλησε;"
						+ "\n 2)Προσπάθησε πρώτα να τον δαμάσει;");
		answer = Quiz.takeAnAnswer(2);
		k = false;
		
		switch (answer) {

		case 1:
			break;

		case 2:
			panel.setMessage("\nΠοιό το αποτέλεσμα;"
							+ "\n 1)Πέτυχε και υπάκουε τις εντολές του Ηρακλή;" 
							+ "\n 2)Απέτυχε.");
			answer = Quiz.takeAnAnswer(2);

			if (answer == 1) {
				panel.setMessage("\n 1)Πρόσταξε τον Ταύρο να παραδωθεί στον Ευρυσθέα.\n"
						+ "\n 2)Πρόσταξε το ταύρο να πάει να σκοτώσει τον Ευρυσθέα."
						+ "\n 3)Πρόσταξε τον ταύρο να τον βοηθήσει να πάρει εκδίκηση από την Ήρα.");
				answer = Quiz.takeAnAnswer(3);

				//panel.setMessage("Συνειδητοποίησε ότι παρά την δυσκολία των άθλων,\n"
					//	+ "πρέπει να συνεχίσει ώστε να φτάσει στη λύτρωση.");
				if (answer == 1) {
					panel.setMessage("\nΟ μινώταυρος μετά από αρκετή επιμονή τον υπάκουσε");
					
				} else if (answer == 2) {
					panel.setMessage("\nΣυνειδητοποίησε ότι παρά την δυσκολία των άθλων, πρέπει να συνεχίσει ώστε να φτάσει στη λύτρωση"
									+ "\nκαι όχι να σκοτώσει τον Ευρυσθέα.");
					reset();

				} else if (answer == 3) {
					answer = 1;
				}

			} else if (answer == 2){
				panel.setMessage("\nΤην ώρα που προσπαθούσε να τον δαμάσει,ο μινώταυρος τον χτύπησε με δύναμε και τον σκότωσε.");
				reset();
			
			}
		}	
	}
	
	/*****************************************************
	 * The eighth story part that Hercules gets the Belt
	 * for Eurystheas' daughter.
	 *****************************************************/

	private static void theBelt() {
		assert checkpoint == 8 : "Wrong checkpoint";
		panel.setMessage("\nΜετά από το κατόρθωμα αυτό του Ηρακλέους, η κόρη του Ευρυσθέα, η Αδμήτη, ζήτησε να της φέρει τη ζώνη της Ιππολύτης,"
				   +"\nτης βασίλισσας των Αμαζόνων, κι ο Ευρυσθέας διέταξε τον Ηρακλή να εκτελέσει την επιθυμία της κόρης του. Ο Ηρακλής,"
				   +"\nμετά από πολλές περιπέτειες, βρήκε τον πολεμικό λαό των Αμαζόνων και προσπάθησε να πάρει τη ζώνη της βασίλισσάς τους."
				   +"\nΑυτές όμως τον αντιμετώπισαν τόσο άγρια και με πολύ θυμό αρνήθηκαν να του δώσουν αυτό που ήθελε, ώστε ο Ηρακλής αναγκάστηκε να"
				   +"\nσκοτώσει την Ιππολύτη και να πάρει τη ζώνη.");
		panel.setMessage("\nΤι έκανε εφόσον απέκτησε τη ζώνη;" 
						+ "\n 1)Tην παρέδωσε στην κόρη του Ευρυσθέα."
						+ "\n 2)Την πήγε στον Άρη ζητώντας του ως αντάλλαγμα βοήθεια για να εκδικηθεί την Ήρα για το χαμό της οικογένειάς του.");
		answer = Quiz.takeAnAnswer(2);
		
		if (answer == 1) {
			panel.setMessage("\nΈπειτα συνέχισε με τους υπόλοιπους άθλους του");

		} else if (answer == 2) {
			panel.setMessage("\nΗ Ήρα του είχε προκαλέσει πολλά δεινά στη ζωή του και σε αυτόν τον άθλο μεταμορφώθηκε σε αμαζόνα και ξεσήκωσε τις υπόλοιπες. "
					   		+"\nΈτσι ξύπνησε το μίσος του για εκείνη και γι'αυτό ζήτησε τον θάνατο της από τον Άρη.");
			panel.setMessage("\nΈτσι λοιπόν ο Άρης με τον Μινώταυρο και τη βοήθεια άλλων θεών, σκότωσαν την Ήρα για εκδίκηση.");
			reset();

		}
	}
	
	/*****************************************************
	 * The ninth story part that talks about Antaios' brothers
	 * who tried to kill Hercules.
	 *****************************************************/

	private static void dwarfBrothers() {
		assert checkpoint == 9 : "Wrong checkpoint";
		checkpoint++;
		panel.setMessage("\nΟι Πυγμαίοι, νάνοι αδελφοί του Ανταίου, επιτέθηκαν για εκδίκηση στον Ηρακλή ενώ αυτός κοιμόταν."
						+ "\nΤι συνέβη μετά;"
						+ "\n 1)Λόγω της ασήμαντης επιθεσής τους, ο Ηρακλής τους παγίδευσε στη λεοντή του και τους πήγε στον Ευρυσθέα." 
						+ "\n 2)Τον έδεσαν με σχοινιά στο έδαφος."
						+ "\n 3)Κατάφεραν να τον τυφλώσουν και να πάρουν εκδίκηση για τον αδελφό τους.");
		answer = Quiz.takeAnAnswer(3);

		if (answer == 1) {
			panel.setMessage("\nΈτσι ο Ηρακλής εκπλήρωσε και αυτόν τον άθλο του");

		} else if (answer == 2) {
			panel.setMessage("\nΈπειτα τι έγινε;"
							+ "\n 1)Tα σκοινιά ήταν πολύ μικρά και ο Ηρακλής κατάφερε να σπάσει τα δεσμά του."
					 		+" \n 2)Ο Ηρακλής δεν κατάφερε να ελευθερωθεί.");
			answer = Quiz.takeAnAnswer(2);
			
			if (answer == 1) {
				panel.setMessage("\nΈτσι ο Ηρακλής τους παγίδευσε στη λεοντή του και τους πήγε στον Ευρυσθέα.");

			} else if (answer == 2) {
				panel.setMessage("\nΟι Πυγμαίοι πήραν την εκδίκηση τους.");
				reset();
			
			}
		} else if (answer == 3) {
			panel.setMessage("\nΟι Πυγμαίοι πήραν την εκδίκηση τους.");
			reset();
			
		}	
	}
	
	/*****************************************************
	 * The tenth and last story part in which Hercules
	 * wife betrays him wanting or not.
	 *****************************************************/

	private static void wifeBetrayal() {
		assert checkpoint == 10 : "Wrong checkpoint";
		checkpoint++;
		panel.setMessage("\nΟ Ηρακλής σκότωσε τον Νέσσο, ο οποίος προσπάθησε να κλέψει την γυναίκα του με δηλητηριασμένα βέλη.Τη στιγμή που ο Νέσσος πέθαινε"
				   		+"\nαπό τα δηλητηριασμένα βέλη του Ηρακλή, εκμυστηρεύθηκε στη Δηιάνειρα ότι ο σύζυγός της δεν την αγαπούσε πια, και ότι για να ξανακερδίσει"
				   		+"\nτην αγάπη του, έπρεπε να του δώσει να φορέσει έναν χιτώνα, αφού τον βουτήξει πρώτα μέσα στο αίμα του νεκρού κενταύρου."
				   		+"\nΗ Δηιάνειρα, η οποία δεν ήξερε ότι το αίμα του Νέσσου ήταν δηλητηριασμένο από τα βέλη, έδωσε τον χιτώνα στον ήρωα.");
		panel.setMessage("\nΌταν η Δηιάνειρα πρόσφερε τον χειτώνα στον Ηρακλή, ο Ηρακλής τι έκανε;"
				+ "\n 1)Ο Ηρακλής φόρεσε τον χιτώνα και από τον έντονο πόνο παρακάλεσε να τον κάψουν."
				+ "\n 2)Ο Ηρακλής είχε παρατηρήσει ότι η γυναίκα του γέμισε τον χιτώνα με αίμα.");
		answer = Quiz.takeAnAnswer(2);

		if (answer == 1) {
			//Τίτλοι τέλους
			panel.setMessage("\nΟ Φιλοκτήτης τότε τον λυπήθηκε και άναψε τη φωτιά πάνω στην κορυφή του βουνού Οίτη και ο Ηρακλής κάηκε ζωντανός."
					   			+"\nΑκόμη και σήμερα, η υψηλότερη κορυφή αυτού του βουνού ονομάζεται Πυρά.");
			
		} else if (answer == 2) {
			panel.setMessage("\nΠως έπραξε μετά λοιπόν ο ήρωας;"
							+ "\n 1)Ο Ηρακλής δεν φόρεσε τον χιτώνα και παράτησε τη γυναίκα του."
							+ "\n 2)Ο Ηρακλής από αντίδραση, φόρεσε τον χιτώνα στη γυναίκα του.");
			answer = Quiz.takeAnAnswer(2);
			
			if (answer == 1){
				//Τίτλοι τέλους
				panel.setMessage("\nΈζησε μια ζωή ελεύθερος και μόνος του, περνόντας τον χρόνο του καθημερινά με κυνήγι και ψάρεμα.");
			
			} else if (answer == 2){
				//Τίτλοι τέλους
				panel.setMessage("\nΚαθώς νόμιζε πως η γυναίκα του ήθελε να τον βλάψει απόφασισε να το κάνει πρώτος εκείνος."
								+ "\nΕίδε την γυναίκα του να πεθαίνει σιγά σιγά από τους πόνους");
			
			}
			
		}
	}
	
	/*****************************************************
	 * ordinaryPerson is a story that Hercules is displayed
	 * either as a common mortal or he has forgotten the
	 * reason he is doing the feats.
	 *****************************************************/

	private static void ordinaryPerson() {
		checkpoint--;
		if (father_zeus) {
			panel.setMessage("\nΟ Ηρακλής έπειτα εκπαιδεύτηκε για να μάθει νέες τέχνες.");
		}
		teachers();
		moreJobs();
		answer_given = sthingMissing();
		if (answer_given == 1) {
			oikogeneiarxhs();
			relationKids();
		} else if (answer_given == 2){
			periodia();
		}
	}

	private static void teachers() {
		String teacher1 = "του ηνιόχου";
		String teacher2 = "της οπλασκίας";
		String teacher3 = "της πάλης";
		panel.setMessage("\nΜε ποιους εκπαιδεύτηκε ο Ηρακλής;"
						+ "\n 1) Αμφιτρύωνα."
						+ "\n 2) Κάστορα."
						+ "\n 3) Αίλυκος.");
		answer = Quiz.takeAnAnswer(3);
		panel.setMessage("\nΟ Ηρακλής έμαθε την τέχνη ");
		if (answer == 1) {
			panel.setMessage(teacher1 + "και άρχισε να δουλεύει ως ηνίοχος.");
		} else if (answer == 2) {
			panel.setMessage(teacher2 + "και άρχισε να δουλεύει ως μισθοφόρος.");
		} else {
			panel.setMessage(teacher3 + "και άρχισε να δουλεύει ως παλεστής.");
		}
	}
	
	private static void moreJobs() {
		panel.setMessage("\nΟ Ηρακλής όμως επειδή κουράστηκε από την μονοτονία της δουλειάς του, "
						+ "\nαποφάσησε να ασχοληθεί και με κάτι άλλο.");
		panel.setMessage("\nΜε τι άλλο ασχολήθηκε ο Ηρακλής;"
				+ "\n 1)Τόξο."
				+ "\n 2)Επιστήμη."
				+ "\n 3)Μουσική.");
		answer = Quiz.takeAnAnswer(3);
		panel.setMessage("\nΟ Ηρακλής έπειτα συνδίασε όλες τις ικανότητές του και τις γνώσεις του, αλλά κάτι του έλλειπε.");
	}
	
	private static int sthingMissing() {
		panel.setMessage("\nΤι έκανε για την έλλειψη αυτή που ένιωθε μέσα του;"
						+ "\n 1)Έγινε οικογενειάρχης."
						+ "\n 2)Έγινε ταξιδιώτης.");
		answer = Quiz.takeAnAnswer(2);
		if (answer == 1) {
			panel.setMessage("\nΟ Ηρακλής αποφάσισε να νοικοκυρευτεί και βρήκε μία καλή γυναίκα.");
			return answer;
		} else {
			panel.setMessage("\nΟ Ηρακλής αποφάσισε να επιδείξει τις ικανότητές του στον κόσμο"
							+ "\nκαι έτσι ξεκίνησε τις περιοδίες του.");
			panel.setMessage("\nΚατάφερε να βγάλει χρήματα στο ταξίδι του;"
							+ "\n 1)Ναι."
							+ "\n 2)Όχι.");
			answer = Quiz.takeAnAnswer(2);
			if (answer == 1) {
				panel.setMessage("\nΟ Ηρακλής αφού έβγαλε χρήματα πήρε την απόφαση να φτιάξει την δική του οικογένεια.");
				return answer;
			} else {
				panel.setMessage("\nΟ Ηρακλής συνέχισε τις περιοδίες του.");
				return answer;
			}
		}
	}
	
	private static void oikogeneiarxhs() {
		panel.setMessage("\nΟ Ηρακλής πόσα παιδιά έκανε;"
						+ "\n 1)1 κόρη."
						+ "\n 2)2 γιους.");
		answer = Quiz.takeAnAnswer(2);
		 
	}
	
	private static void relationKids() {
		panel.setMessage("\nΟ Ηρακλής με όλες τις κακουχίες που είχε περάσει προσπαθούσε πάνω από όλα να είναι καλός πατέρας."
						+ "\n\nΠώς πιστεύεται ότι ήταν η σχέση μεταξύ του Ηρακλή και τα παιδιά του;"
						+ "\n 1)Αγαπημένη και ομαλή."
						+ "\n 2)Πάντα εκδικητική και ανταγωνιστική.");
		answer = Quiz.takeAnAnswer(2);
		panel.setMessage("\nΈπειτα από αρκετά χρόνια πως πιστεύεται ότι κατέληξε η ζωή του ήρωας;");
		if (answer == 1) {
			panel.setMessage("\n 1)Πεθαίνοντας άφησε ολόκληρη την περιουσία του στην οικογένειά του έχοντας μεταλαμπαδεύσει στα παιδιά του"
							+ "\nόσα περισσότερες γνώσεις μπορούσε."
							+ "\n 2)Λόγω κακής διαχείρησης των οικονομικών τους απέκτησαν χρέη με αποτέλεσμα με το θάνατο του Ηρακλή,"
							+ "\nολόκληρη η περιουσία του πέρασε στην πολιτεία και η οικογένειά του προσπάθησε να πορευτεί"
							+ "\nστην ζωή έχοντας λίγα πράγματα στην κατοχή τους.");
		} else if (answer == 2) {
			panel.setMessage("\n 1)Η γυναίκα του τον σκότωσε καθώς αυτή υπολόγιζε μόνο το χρήμα και"
							+ "\nήθελε να πάρει ολόκληρη την περιουσία του στα χέρια της."
							+ "\n 2)Ο Ηρακλής αποστασιοποιήθηκε από ολόκληρη την οικογένειά του,"
							+ "\nκαθώς ήθελε να ζήσει με γαλήνει μόνος του μέχρι τον θάνατο.");
		}
		answer = Quiz.takeAnAnswer(2);
	}
	
	private static void periodia() {
		panel.setMessage("\nΟ Ηρακλής παρά το μακρύ και πολλών χρόνων ταξίδι του δεν ήθελε να φτιάξει οικογένεια."
						+ "\nΤι έκανε όμως ο Ηρακλής όμως;"
						+ "\n 1)Έκανε περιστασιακές δουλειές προσπαθώντας να τα βγάλει ως προς το ζην."
						+ "\n 2)Παρατήρησε ότι δεν έβγαζε αρκετά χρήματα και έγινε ένας κλέφτης.");
		answer = Quiz.takeAnAnswer(2);
		if (answer == 2) {
			panel.setMessage("\nΔυστυχώς κάποια στιγμή πιάσανε τον Ηρακλή και τον φυλάκισαν,"
							+ "\nόπου και πέρασε τα υπόλοιπα χρόνια της ζωής του.");
		}
	}
	
	/*****************************************************
	 * reset is a method in which the story is getting
	 * reseted as Hercules has died or something close to
	 * that.
	 *****************************************************/
	
	private static void reset() {
		
		/*****************************************************
		 * The checkpoint is getting set 2 positions back so
		 * the player has another chance to continuing the
		 * story.
		 *****************************************************/
		
		checkpoint--;
	}

	private static void endingTitles() {
		panel.setMessage("\nΜε αυτόν τον τρόπο και μετά από πολλά χρόνια τελείωσε η ζωή του μυθικού"
						+ "\nαυτού ήρωα."
						+ "\n"
						+ "\n		THE END");
		panel.setMessage("\nΕπιμέλεια και Παραγωγή: Mythology Collapse");
	}
}
