import java.util.Scanner;

public class Hercules {
	final private static Scanner in = new Scanner(System.in);
	private static String answer_given, answer = null;
	private static int checkpoint = 1;

	/*
	 * q1:Ποιος ήταν ο Πατέρας του Ηρακλή q2:Η Ήρα ζήλευε τον τον Δία και αν ναι πως
	 * αντέδρασε; q3:Ποιον δρόμο επέλεξε ο Ηρακλής; q4:Πως έπραξε όταν
	 * συνειδητοποίησε τι έκανε; q5:
	 */
	public Hercules() throws NoSuchAnswer {
		System.out.println("Η αρχή του παιχνιδιού...");
		while (checkpoint != 10) {
			if (checkpoint == 1) {
				answer_given = fatherOfHercules();
			} else if (checkpoint == 2) {
				answer_given = jealousyOfHera(answer_given);
			} else if (checkpoint == 3) {
				answer_given = roadChoosing();
			} else if (checkpoint == 4) {
				answer_given = howHeDealt();
			} else if (checkpoint == 5) {
				answer_given = killingHydra();
			} else if (checkpoint == 6) {
				answer_given = pathDigging();
			}
		}
		/*
		 * } else if (checkpoint == 7) { answer_given=q7(answer_given); } else if
		 * (checkpoint == 8) { answer_given=q8(answer_given); } else if (checkpoint ==
		 * 9) { answer_given=q9(answer_given); } else if (checkpoint == 10) {
		 * answer_given=q10(answer_given);
		 */
	}
	
	System.out.println("Ο Ηρακλής ήταν αρχαίος μυθικός ήρωας, θεωρούμενος ως ο μέγιστος των Ελλήνων ηρώων."
			   +"Ως Άθλοι του Ηρακλέους έχουν καταγραφεί στην ελληνική μυθολογία δώδεκα κατορθώματα που έκανε ο μυθικός αυτός ήρωας,"
			   +"προκειμένου να εξαγνισθεί για το φόνο της γυναίκας του και των παιδιών του, που είχε διαπράξει όταν τον τρέλανε η Ήρα."
			   +"Για το σκοπό αυτό, ο Ηρακλής πήγε στο Μαντείο των Δελφών και πήρε χρησμό, σύμφωνα με τον οποίο έπρεπε να υπηρετήσει για δώδεκα χρόνια τον Ευρυσθέα,"
			   +"βασιλιά της Τίρυνθας, και να πραγματοποιήσει τους άθλους που του πρόσταζε εκείνος. Το ακόλουθο παιχνίδι θα βασιστεί πάνω σε ερωτήσεις σχετικά"
			  +"με τη ζωή του ήρωα και τους άθλους που διέπραξε.");

	// 1η Ερώτηση: answer η απάντηση που θα δώσει ο χρήστης. Έπειτα αυτό επιστρέφει
	// ως το "answer_given"

	private static String fatherOfHercules() throws NoSuchAnswer {
		checkpoint++;
		System.out.println("Ποιός ήταν ο πατέρας του Ηρακλή;\n" + " 1)Δίας.\n" + " 2)Αμφιτρύωνας.");
		answer = in.next();
		if (answer.equals("1") || (answer.equals("2"))) {
			return answer;
		} else {
			throw new NoSuchAnswer();
		}
	}

	private static String jealousyOfHera(String already_answered) throws NoSuchAnswer {
		checkpoint++;
		if (already_answered.equals("1")) {
			System.out.println("Σύμφωνα με τη μυθολογία αυτήν είναι η σωστή απάντηση παρότι η Αλκμήνη,μητέρα του Ηρακλή, ήταν παντρεμένη με τον Αμφιτρύωνα,"
					   +"ο Δίας πήρε τη μορφή του Αμφιτρύωνα και κοιμήθηκε με την Αλκμήνη.");
			System.out.println("Η Ήρα,η γυναίκα του Δία,τον ζήλευε όταν γεννήθηκε ο Ηρακλής και αν ναι πως αντέδρασε;\n " + "1)Ναι.\n " + "2)Όχι.");
			answer = in.next();

			if (answer.equals("1")) {
				System.out.println(" 1)Η Ήρα έστειλε φίδια για να σκοτώσουν τον Ηρακλή.\n"
						+ " 2)Η Ήρα πήγε η ίδια να σκοτώσει τον Ηρακλή.");
				answer = in.next();
				if (answer.equals("1")) {
					System.out.println("Η Ήρα η οποία ζήλευε θανάσιμα τον Δία για τις απιστίες του προκειμένου να τον εκδικηθεί έστειλε στην κούνια"
							   +"του βρέφους Ηρακλή δύο φίδια, αλλά αυτός κατάφερε να τα στραγγαλίσει.");
				} else if (answer.equals("2")) {
					System.out.println(" 1)Η Ήρα απέτυχε και δεν σταμάτησε να αναζητεί τρόπο εκδίκησης.\n "
							+ " 2)Η Ήρα πέτυχε τον στόχο της και ο Ηρακλής πέθανε.");
					answer = in.next();
					if (answer.equals("1")) {
						System.out.println("Η Ήρα μετά από κάποια χρόνια κατάφερε να βρει τρόπο να σκοτώσει τον Ηρακλή,παίρνοντας την μορφή ενός φίλου "
								   +"και πνίγοντάς τον στον ύπνο του");
					} else if (answer.equals("2")) {
						System.out.println("Ο Ηρακλής πέθανε πολύ νωρίς στην Ιστορία. \n");
						reset();

					} else {
						throw new NoSuchAnswer();
					}

				} else {
					throw new NoSuchAnswer();
				}

			} else if (answer.equals("2")) {
				System.out.println("Δεν ζήλευε, οπότε ο Ηρακλής δεν έμαθε ποτέ τις πραγματικές του δυνάμεις. \n");
				ordinaryPerson();
				return "1";
			} else {
				throw new NoSuchAnswer();
			}

		} else if (answer.equals("2")) {
			checkpoint--;
			System.out.println("Ο θετός πατέρας του Ηρακλή, ο Αμφιτρύωνας,ανέλαβε να τον μεγαλώσει. Είχαν μια άριστη σχέση πατέρα και γιού,περνόντας αρκετό χρόνο"
					   +"μαζί και κάνοντας διάφορα πράγματα.Τον δίδαξε την τέχνη του ηνιόχου, πήγαιναν για ψάρεμα και για κυνήγι και για τον Ηρακλή"
					   +"ο Αμφιτρύωνας ήταν κάτι σαν το πρότυπό του.");
			ordinaryPerson(); // Η Ιστορία με πατέρα τον Αμφιτρύωνα.
		}
		return answer;
	}

	private static String roadChoosing() throws NoSuchAnswer {
		checkpoint++;
		System.out.println("Ο μύθος που σώθηκε από τον Ξενοφώντα, μας διηγείται το περιστατικό εκείνο, όταν ο Ηρακλής καθισμένος σε κάποιο σταυροδρόμι,"
				   +"είδε να περνούν από μπροστά του δύο πανέμορφες κοπέλες. Η μια του έδειξε έναν εύκολο δρόμο, φαρδύ και ίσιο, που αν τον ακολουθούσε,"
				   +"θα χαιρόταν τη ζωή, αλλά θα έκανε ένα σωρό κακές πράξεις που θα τον καταδίκαζαν στην κρίση των ανθρώπων. Αυτή ήταν η Κακία."
				   +"Η άλλη κόρη, η Αρετή, του έδειξε ένα δύσκολο δρόμο, γεμάτο κοφτερές πέτρες και αγκάθια, στενό και δύσβατο, που θα τον βάδιζε δύσκολα,"
				   +"αλλά θα κέρδιζε στο τέλος του την αναγνώριση από τους συνανθρώπους του.");
		System.out.println("Ποιόν δρόμο τελικά επέλεξε ο Ηρακλής;\n" + " 1)Της Αρετής. \n" + " 2)Της Κακίας. \n");
		answer = in.next();
		if (answer.equals("1")) {
			System.out.println( "ο Ηρακλής ακολούθησε την Αρετή, προτιμώντας να υποφέρει για να διαβεί το δύσβατο δρόμο της, αλλά να γνωρίσει τη δόξα και την τιμή"
					   +"με τις καλές του πράξεις και την αρετή του.Με την επιλογή του αυτήν η Ήρα συνέχισε να ζηλεύει και παρέσυρε τον Ηρακλή στο να "
					   +"σκοτώσει τη γυναίκα του και τα παιδιά του.");

		} else if (answer.equals("2")) {
			System.out.println(
					"Ο Ηρακλής μεγάλωσε με πολλές γυναίκες και πολλά παιδιά σε ένα ανέμελο δρόμο με πολλές χαρές.\n Παρόλα αυτά η Ήρα συνέχισε να ζηλεύει και τρέλανε τον Ηρακλή οδηγώντας τον να σκοτώσει τη γυναίκα του και τα τρία παιδιά του.");
			System.out.println("Πως συνέχισε ο Ηρακλής την ζωή του;\n"
					+ " 1)Άρχισε να αναπολεί το παρελθόν του και μετάνιωσε για ότι έκανε με παρακίνηση της Ήρας.\n"
					+ " 2)Συνέχισε με την ανέμελη ζωή του.");
			answer = in.next();

			if (answer.equals("1")) {
				System.out.println("Προσπάθησε να βρει έναν τρόπο για να διορθώσει ότι είχε κάνει.");

			} else if (answer.equals("2")) {
				System.out.println("Στα πλαίσια μιας φυσιολογικής και ανέμελης ζωής, έφτασε σε μεγάλη ηλικία πεθαίνοντας από φυσικά αίτια.");
				reset();

			} else {
				throw new NoSuchAnswer();
			}

		} else {
			throw new NoSuchAnswer();
		}

		return answer;
	}

	private static String howHeDealt() throws NoSuchAnswer {
		checkpoint++;
		System.out.println("Πως έπραξε ο Ηρακλής όταν συνειδητοποίησε τι έκανε;\n"
				+ " 1)Πήγε στο μαντείο των Δελφών για να μάθει πως μπορούσε να επανορθώσει. \n"
				+ " 2)Αυτοκτόνησε από την θλίψη του.");
		answer = in.next();

		if (answer.equals("1")) {
			System.out.println(" Όταν συνειδητοποίησε τι έκανε, αποφάσισε να πάει στο Μαντείο των Δελφών για να πάρει χρησμό, ώστε να μάθει με ποιον τρόπο"
					   +"θα μπορούσε να εξαγνισθεί. Σύμφωνα με τον χρησμό, έπρεπε να υπηρετήσει για δώδεκα χρόνια τον Ευρυσθέα, βασιλιά των Μυκηνών,"
					   +"και να πραγματοποιήσει τους άθλους που θα του πρόσταζε εκείνος.");
		} else if (answer.equals("2")) {
			System.out.println("Οι τύψεις που τον έπνιγαν τον οδήγησα να αυτοκτονήσει από την θλίψη του και έτσι πέθανε νωρίς στην ιστορία.");
			reset();

		} else {
			throw new NoSuchAnswer();
		}

		return answer;

	}

	private static String killingHydra() throws NoSuchAnswer {
		checkpoint++;
		// System.out.println("Αφήγηση σχετικά με την Λερναία Ύδρα.");
		System.out.println("Το δεύτερο κατόρθωμά του Ηρακλή είχε να κάνει με την Λερναία Ύδρα, ενός φιδιού με εννέα κεφάλια που ζούσε στη λίμνη Λέρνη και"
				   +"σκορπούσε τη συμφορά στους κατοίκους της περιοχής. Στη θέση κάθε κεφαλιού που έκοβες όμως ξεπετιόνταν άλλα δύο, "
				   +"και έτσι η εξόντωση της ήταν αρκετά δύσκολη.");
		System.out.println("Με ποιόν τρόπο προσπάθησε,λοιπόν, να νικήσει την Λερναία Ύδρα;\n"
				+ " 1)Καθώς έκοβε το κεφάλι, έκαβε ταυτόχρονα και τις πληγές\n"
				+ " 2)Προσπάθησε να καρφώσει την καρδία της Λερναίας Ύδρας.\n"
				+ " 3)Δεν προσπάθησε και απλώς έτρεξε να ξεφύγει");
		answer = in.next();

		if (answer.equals("1")) {
			System.out.println("Αφού στη θέση κάθε κεφαλιού που έκοβε ο Ηρακλής ξεπετιόνταν άλλα δύο,αναγκάστηκε όταν έκοβε ένα κεφάλι να καίει με φωτιά το κόψιμο."
					   +"Ήταν ο μοναδικός τρόπος να καταφέρει να την νικήσει"
					   +"Ύστερα, αφού σκότωσε το θηρίο, βούτηξε στο αίμα του τα βέλη του και τα κατέστησε θανατηφόρα.");

		} else if (answer.equals("2")) {
			System.out.println("Τα κατάφερε, αλλά η Λερναία Ύδρα δεν πέθανε και έτσι ο Ηρακλής σκοτώθηκε.);");
			reset();

		} else if (answer.equals("3")) {
			System.out.println("Τι έκανε μετά;\n" + " 1)Σταμάτησε να τρέχει και ξανά σκέφτηκε τον τρόπο αντιμετώπισης.\n"
							+ " 2)Συνέχισε να τρέχει μέχρι που γύρισε τον Ευρυσθέα.");
			answer = in.next();

			if (answer.equals("1")) {
				System.out.println("Ο Ηρακλής προσπαθεί ξανά να βρει κάποιον τρόπο να εξοντώσει την Λερναία Ύδρα");
			} else if (answer.equals("2")) {
				System.out.println("Ο Ευρυσθέας του υπενθύμισε γιατί κάνει τους άθλους του και πως έπρεπε να τα καταφέρει.");
				System.out.println("Πως έπραξε ο Ηρακλής μετά από αυτήν την υπενθύμιση;\n"
						+ " 1)Γύρισε πίσω στην Λερναία Ύδρα για να την αντιμετωπίσει. \n"
						+ " 2)Αυτοκτόνησε από την θλίψη του.\n");
				answer = in.next();

				if (answer.equals("1")) {
					System.out.println("Η ιστορία με την Λερναία Ύδρα αρχίζει και πάλι");
					\\εδώ να μην βάλουμε ένα while έτσι ωστέ να γυρνάει πάλι πίσω μέχρι να προχωρήσει η ιστορία;;

				} else if (answer.equals("2")) {
					System.out.println("Αυτοκτόνησε από την θλίψη και το άγχος του που δεν μπόρεσε να φέρει εις πέρας τους άθλους του.");
					reset();

				} else {
					throw new NoSuchAnswer();
				}

			} else {
				throw new NoSuchAnswer();
			}

		} else {
			throw new NoSuchAnswer();
		}
		return answer;
	}

	private static String pathDigging() throws NoSuchAnswer {
		checkpoint++;
		System.out.println("Ένας άλλος άθλος του Ηρακλή ήταν να καθαρίσει τους στάβλους του Αυγεία, του πλούσιου βασιλιά με τα 3.000 βόδια,"
				   +"που από την κοπριά που είχε μαζευτεί εκεί από τριάντα χρόνια, που είχαν να καθαριστούν οι στάβλοι, είχε πρόβλημα όλο το χωριό. ");
		System.out.println(
				"\nΟ Ηρακλής πού έσκαψε για να κατευθύνει τα νερά του Πηνειού και του Αλφειού,\nώστε να καθαρίσουν οι στάβλοι του Αυγεία;"
						+ "\n\n1) Στα θεμέλια των στάβλων." + "\n2) Μέσα στους ίδιους τους στάβλους.");
		answer = in.next();

		if (answer.equals("1")) {
			System.out.println("Ο Ηρακλής με αυτόν τον τρόπο κατάφερε να κάνει τα νερά να παρασύρουν την κοπρία από τους στάβλους και να καθαριστεί το μέρος.");
		} else if (answer.equals("2")) {
			System.out.println("\nΤι αποτελέσματα είχε αυτό στους στάβλους και στην περιοχή;"
					+ " \n\n1)Καταστράφηκαν οι στάβλοι εντελώς." + " \n2)Δεν επηρρεάστηκαν καθόλου.");
			answer = in.next();

			if (answer.equals("1")) {
				System.out.println(
						"Έσπασαν οι φράχτες,τα ζώα το έσκασαν και κατέστερψαν την πόλη, με αποτέλεσμα οι κάτοικοι να ζητήσουν την ευθανασία του Ηρακλή."
				+"ως εκδίκηση για τις περιουσίες τους που καταστράφηκαν.");
				reset();

			} else if (answer.equals("2")) {
				System.out.println("Δεν είχε κανένα αποτέλεσμα στους στάβλους και στην γύρω περιοχή. "
						+ "Ο Ηρακλής συνέχισε κανονικά τη ζωή του ως ένας συνηθισμένος άνθρωπος.");
				ordinaryPerson();

			} else {
				throw new NoSuchAnswer();
			}
		} else {
			throw new NoSuchAnswer();
		}
		return answer;
	}

	private static void ordinaryPerson() {
		checkpoint--;
		System.out.println("Ο Ηρακλής είχε μια φυσιολογική και ανέμελη ζωή. Ήταν αρκετά δραστήριος και του άρεσε το κυνηγί και το ψάρεμα. Ζούσε αρμονικά με την οικογένεια "
				   +"του και περνούσε πολύ από τον ελεύθερο χρόνο με τα παιδιά του, κάνοντας διάφορα πράγματα μαζί τους."
	}

	private static void reset() {
		checkpoint--;
	}
}
