package odyssey;
import java.util.*;

public class Odyssey {
static int answer;
static int answer2;
static Scanner input = new Scanner (System.in);
	
	public static void ithaki() {
		System.out.println("Όταν ο Οδυσσέας φτάνει στην Ιθάκη, μαθαίνει ότι η πολύχρονη απουσία του έχει αφήσει εκτεθειμένη την γυναίκα του,\n"
				+ "την Πηνελόπη, η οποία περιτριγυρίζεται από φιλόδοξους μνηστήρες.\n"
				+ "Η μόνη ελπίδα για να εισχωρήσει στο παλάτι και να σώσει την οικογένεια και τον θρόνο του είναι μια θεϊκή παρέμβαση. Θα βοηθήσει η Αθηνά αυτή τη φορά τον Οδυσσέα, ή θα τον αφήσει στο έλεος της μοίρας?\n\n"
				+ "1: Η Αθηνά θα τον βοηθήσει ή 2: Η Αθηνά δεν θα τον βοηθήσει. (πληκτρολόγησε τον αριθμό της απάντησης)");
		answer = input.nextInt();
		checkAnswer(2);
		
//έκβαση ανάλογα την απάντηση
		if (answer==1) {
			System.out.println("Η Αθηνά αποφασίζει να βοηθήσει τον Οδυσσέα για ακόμη μια φορά και έτσι, τον μεταμφιέζει σε ζητιάνο ώστε οι μνηστήρες να μην μπορέσουν να τον υποπτευθούν.\n"
					+ "Ωστόσο, σε μια επίσκεψή του στο παλάτι, η υπηρέτρια που καλείται να περιποιηθεί τον ξένο, αναγνωρίζει το σημάδι που έχει στο πόδι του και ανακαλύπτει ότι έχει μπροστά της\n"
					+ "το χαμένο βασιλιά.\n\n"
					+ "Οργανώνονται, λοιπόν, αγώνες τοξοβολίας, στους οποίους παίρνει μέρος και ο ίδιος πετυχαίνοντας μια δοκιμασία που μόνο ο Οδυσσέας είχε καταφέρει μέχρι τότε.\n"
					+ "Αμέσως, πετάει τα κουρέλια που φοράει και αποκαλύπτει ποιος είναι. Ξεκινάει ένα ανθρωποκυνηγητό με τον Οδυσσέα και το γιο του, Τηλέμαχο, να κυνηγάνε τους μνηστήρες και εκείνοι να τρέχου για τη ζωή τους.\n"
					+ "Τελικά, ο Οδυσσέας έχει πλέον μετά τα πολύχρονα βάσανά του να κερδίσει ξανά τη θέση του στο παλάτι και στην οικογένειά του.");
		} else {
			System.out.println("Χωρίς τη βοήθεια της Αθηνάς, ο Οδυσσέας αναγνωρίζεται αμέσως από τους μνηστήρες και ανήμπορος ως ήταν, χώρις όπλα για να πολεμήσει θανατώνεται τελικά από τους φιλόδοξους κατακτητές του θρόνου του...");
			death();
		}
	}
	
	
	
	public static void seirines () {
		System.out.println("Μετά το χρησμό του μάντη Τειρεσία, το καράβι του Οδυσσέα οδηγείται στις Σειρήνες.\n"
				+ "Εκεί ο Οδυσσέας πάνω στη λαχτάρα να ακούσει το τραγούδι των σειρήνων φτάνει στο  δίλημμα για το αν θα δεθεί ή όχι στο καταρτι.\n\n"
				+ "1: Θα δεθεί στο κατάρτι ή 2: Δεν θα δεθεί στο κατάρτι (Πληκτρολόγησε τον αριθμό της επιλεγμένης απάντησης.)");
		answer = input.nextInt();
		checkAnswer(2);
		
//έκβαση ανάλογα την απάντηση
		if (answer == 1) {
			System.out.println("Αφού κλείνει τα αυτιά των συντρόφων του με κερί, ο Οδυσσέας δένεται στο κατάρτι.\n"
					+ "Όταν πλησιάζουν στις σειρήνες, ο ίδιος μαγεύεται και παρακαλά τους ναύτες να τον λύσουν. Εκείνοι, όμως, δε τον ακούνε και συνεχίζουν την πορεία τους αποφεύγοντας τα δολοφονικά τέρατα.");
			skyla(illness);
		} else {
			System.out.println("Ο Οδυσσέας νομίζοντας ότι μπορεί να αντισταθεί στις σειρήνες, βουλώνει τα αυτιά των συντρόφων του με κερί και παραμένει να ακούει τις σειρήνες να τραγουδούν.\n"
					+ "Το μαγευτικό τους τραγούδι, όμως, τον παρασέρνει και πέφτει στη θάλασσα, όπου και πνίγεται...");
			death();
		}	
	}
	
	
	
	public static void skyla (boolean illness) {
		System.out.println("Σειρά έχουν η Σκύλλα και η Χάρυβδη, ένα εξακέφαλο τέρας και μια τεράστια ρουφήχτρα,\n"
				+ "τις οποίες επιδεικτικά καταφέρνουν να απογύγουν.");
		if (illness) {
			System.out.println("ο Οδυσσέας λαμβάνει το αντίδοτο της ασθένειάς του");
			timer.cancel();
		}
		ilios();
	}
	
	
	public static void ilios () {
		System.out.println("Πλέον προοδευτικά προς το νησί του ήλιου. Εκεί οι σύντροφοι πεινασμένοι αναζητούν τροφή στα βόδια του θεού.\n"
				+ "Θα ταρφούν τελικά, όμως με τα ιερά ζώα? Και αν ναι πώς θα εξελιχθεί η προφητεία του Τειρεσία?\n\n"
				+ "1: Θα τραφούν με τα βόδια ή 2: Δεν θα τραφούν με τα βόδια; (Πληκτρολόγησε την απάντηση)");
		answer = input.nextInt();
		checkAnswer(2);
		

		if (answer == 1) {
			System.out.println("Οι σύντροφοι που πέθαιναν από την πείνα, τρέφονται τελικά από τα βόδια.\n\n"
					+ "Ο Δίας βλεποντας όλο αυτό το διάστημα τη δυστυχία του ήρωά μας αποφασίζει να του δώσει μια ευκαιρία να γυρίσει στην Ιθάκη.\n"
					+ "Του προτείνει να φτάσει άμεσα στην Ιθάκη με αντάλλαγμα ένα πολύ αγαπημένο του πρόσωπο. Τι θα κάνει άραγε ο Οδυσσέας;\n\n"
					+ "1: Θα δεχτεί την προσφορά του Δία ή 2: Δεν θα δεχτεί την προσφορά του Δία (Πληκτρολόγησε την επιθυμητή απάντηση)");
			answer2 = input.nextInt();
			checkAnswer(2);
			if (answer2 == 1) {
				System.out.println("Ο Δίας τον στέλνει με ευνοϊκούς ανέμους στην Ιθάκη αλλά φτάνοντας εκεί αντιλαμβάνεται ότι ο αγαπημένος του γιος ο Τηλέμαχος είναι νεκρός");
				ithaki();
			} else {
				System.out.println("Ο Δίας για τους τιμωρήσει για την ασέβειά τους στέλνει καταιγίδα που τους σκοτώνει όλους πέρα από τον Οδυσσέα.\n"
						+ "Εκείνος καταλήγει ναυαγός στο νησί της Καλυψώς που τον περιθάλπει, τον ερωτεύεται και τον κρατάει εκεί για 7 ολόκληρα χρόνια.");
				kalipso();
			}
		} else {
			System.out.println("Ο Οδυσσέας καταλήγει αν πείσει τους συντρόφους του να μη φάνε τα βόδια και έτσι η προφητεία του Τειρεσία εκπληρώνεται και γυρνάνε τελικά στην πατρίδα ");
			ithaki();
		}
	}
	
	
	public static void kalipso () {
		System.out.println("Εκεί ο Οδυσσέας θα ξεχάσει άραγε την πατρίδα και τη γυναίκα του ή θα θελήσει με την βοήθεια της Αθηνάς να επιστρέψει στα πολυαγαπημένα του πρόσωπα ?\n\n"
				+ "1: Θα ζητήσει τη βοήθεια της Αθηνάς ή 2: Δεν θα ζητήσει τη βοήθεια της Αθηνάς. (Πληκτρολόγησε τον αριθμό της επιθυμητής απάντησης)");
		answer = input.nextInt();
		checkAnswer(2);
		if (answer == 2) {
			System.out.println("Η καρτερικότητα και η αγάπη της Καλυψώς κατά την παραμονή του στο νησί, μάγεψε τελικά τον Οδυσσέα.\n"
					+ "Η πατρίδα και η οικογένειά του αποτελούσαν πλέον ένα πεθαμένο όνειρο για το Οδυσσέα που αποφάσισε να περάσει την υπόλοιπη ζωή του με την κοπέλα που τον έσωσε.");
			
		} else {
			System.out.println("Η Αθηνά, βλέποντας τον Οδυσσέα επι 7 χρόνια να νοσταλγεί την πολυαγαπημένη του πατρίδα , πείθει την Καλυψώ να του επιτρέψει να πάρει τον δρόμο της επιστροφής.");
			faiakes();
		}
	}
	
	
	public static void teiresias() {
		System.out.println("Επόμενη στάση στο ατέλειωτο ταξίδι ειναι ο ’δης. Εκει συναντάει τον μάντη τειρεσία ο οποίος έχει ένα πολύ σημαντικό χρησμό για την εξέλιξη της ιστορίας. Δεν θα πρέπει να φάει τα βόδια του θεού ήλιου, αν θέλει να επιστρέψει στην Ιθάκη.  Για να πάρει το χρησμό πρέπει να απαντήσει σωστά σε ένα κουίζ.");
		Random rand = new Random();
		int rand1 = rand.nextInt(20); //from 0 to 19
		
		do {
			if(Quiz.availableQuestions[rand1] == false) {
				rand1 = rand.nextInt(20);
			}
		} while (Quiz.availableQuestions[rand1] == false);
		
		Quiz.availableQuestions[rand1] = false;
		
		if (Quiz.questionPicker(rand1+1) == false) {
			System.out.println("Ο Οδυσσέας θα αναγκαστεί να συνεχίσει το ταξίδι του έχοντας χάσει αυτή τη σημαντική πληροφορία");
		}
		
		seirines();
	}
	
	
	public static void faiakes() {
		System.out.println("Στο δρόμο για την Ιθάκη, η μοίρα τον στέλνει στο νησί των Φαιάκων, όπου και αποκαλύπτει ότι πολέμησε στην Τροία μαζί με τους Αχαιούς.  Οι Φαίακες που εξυμνούσαν τους Αχαιούς δέχονται να τον βοηθήσουν, όμως πρέπει να πειστούν ότι ο Οδυσσέας τους λέει αλήθεια. Του κάνουν λοιπόν 3 ερωτήσεις για τον πόλεμο στην Τροία.");
		int counter = 0;
		Random rand = new Random();
		int rand1;
		
		for (int i=0;i<3;i++) {
			rand1 = rand.nextInt(20);
			do {
				if(Quiz.availableQuestions[rand1] == false) {
					rand1 = rand.nextInt(20);
				}
			} while (Quiz.availableQuestions[rand1] == false);
			Quiz.availableQuestions[rand1] = false;
			if (Quiz.questionPicker(rand1+1)) {
				counter++;
			}
		}
		
		if (counter >= 2) {
			System.out.println("Οι φαίακες πείθονται για τη γενναιότητα και τη συμμετοχή του στον πόλεμο και παραχωρούν στον Οδυσσέα εφόδια και ένα πλοίο για να γυρίσει στην Ιθάκη. ");
		} else {
			System.out.println("Οι φαίακες δεν πιστεύουν στην συμμετοχή του στονπόλεμο. Τον διώχνουν θυμωμένοι και δεν του δίνουν εξοπλισμό, ικανό να επιστρέψει στην Ιθάκη. \r\n"
					+ "\r\n"
					+ "Περιπλανώμενος για καιρό με τη σχεδία του φτάνει στο νησί των μουσών.  Εκεί οι μούσες τον φροντίζουν, του δίνουν φαγητό και βλέποντας πόσο πιστός είναι στους θεούς και ειδικά στην Αθηνά τον βοηθούν με εξοπλισμό να φύγει και να σαλπάρει για την πολυαγαπημένη Ιθάκη.");
		}
		
		ithaki();
	}
	
	
	
	
	

	
	
	
	
	
	
	
	public static void checkAnswer(int noOfAnswers) {
		do {
			if (answer > noOfAnswers) {
				System.out.println("λάθος απάντηση. παρακαλώ δοκίμασε ξανά");
				answer = input.nextInt();
			}	
		} while (answer > noOfAnswers);
			
	}
}
